package com.fosung.ksh.meeting.control.hst.config.constant;


import com.fosung.framework.common.support.AppRuntimeDict;
import lombok.AllArgsConstructor;
import lombok.Getter;
import lombok.NoArgsConstructor;

/**
 * 好视通返回码及返回码代表信息
 *
 * @author wangyh
 * @date 2018/12/01
 */
@NoArgsConstructor
@AllArgsConstructor
@Getter
public enum ResultCode implements AppRuntimeDict {
    SUCCESS("0000", "操作成功"),
    ERROR_9999("9999", "系统错误 "),
    ERROR_0001("0001", "ID和名称不能同时为空 "),
    ERROR_0002("0002", "不存在该数据信息或用户操作失误 "),
    ERROR_0003("0003", "密钥错误 "),
    ERROR_0004("0004", "密码不是MD5密码字符串"),
    ERROR_1001("1001", "用户名已存在或者用户参数不全 "),
    ERROR_1002("1002", "用户名为空或格式不正确，包括长度 "),
    ERROR_1003("1003", "密码为空或格式不正确，包括长度 "),
    ERROR_1004("1004", "昵称不为空时格式不正确，包括长度，支持空格等 "),
    ERROR_1005("1005", "组织不为空时格式不正确，包括长度，整数 "),
    ERROR_1006("1006", "角色不为空时格式不正确，包括长度，整数 "),
    ERROR_1007("1007", "性别不为空时格式不正确，包括长度，整数 "),
    ERROR_1008("1008", "电话号码格式不对 "),
    ERROR_1009("1009", "手机号码格式不对 "),
    ERROR_1010("1010", "邮箱格式不对 "),
    ERROR_1011("1011", "用户数量错误 "),
    ERROR_1012("1012", "此用户名的用户不存在 "),
    ERROR_1013("1013", "组织不存在 "),
    ERROR_1014("1014", "角色不存在 "),
    ERROR_1015("1015", "用户删除错误 "),
    ERROR_1016("1016", "查询类型为空或者错误 "),
    ERROR_1017("1017", "用户查询分页超过最大条数 "),
    ERROR_1018("1018", "用户查询传入房间ID为空 "),
    ERROR_1019("1019", "授权会议室名单字符串为空 "),
    ERROR_1020("1020", "授权会议室名单字符串为空或格式不对 "),
    ERROR_1021("1021", "会议室不存在 "),
    ERROR_1022("1022", "会议室删除错误 "),
    ERROR_1023("1023", "传入会议室密码类型错误 "),
    ERROR_1024("1024", "用户保存错误 "),
    ERROR_1025("1025", "用户属性类型只能是1或者2 "),
    ERROR_1026("1026", "不能对系统用户admin、recordclient进行操作"),
    ERROR_2000("2000", "会议ID为空或格式不正确，包括长度应大于3并小于11位"),
    ERROR_2001("2001", "会议室名为空或长度错误 "),
    ERROR_2002("2002", "传入会议室登录校验模型类型不存在 "),
    ERROR_2003("2003", "会议室名最大数量为空或错误 "),
    ERROR_2004("2004", "是否启用主席密码类型值错误 "),
    ERROR_2005("2005", "主席密码为空或格式不正确 "),
    ERROR_2006("2006", "房间信息保存错误 "),
    ERROR_2007("2007", "房间类型修改错误 "),
    ERROR_2008("2008", "日期格式错误错误 "),
    ERROR_2009("2009", "日期开始时间与结束时间不符合常理错误(开始时间晚于结束时间,开始时间早于当前时间)"),
    ERROR_2010("2010", "时间格式错误错误 "),
    ERROR_2011("2011", "开始时间与结束时间不符合常理错误(开始时间晚于结束时间) "),
    ERROR_2012("2012", "周例会议循环模式类型值错误 "),
    ERROR_2013("2013", "周例会为每周时，传入的周字符串错误或为空 "),
    ERROR_2014("2014", "周例会为每月时，传入的每天字符串错误或为空 "),
    ERROR_2015("2015", "传入的是否启用默认配置值错误或为空 "),
    ERROR_2016("2016", "传入的视频编码器值错误或为空 "),
    ERROR_2017("2017", "传入的视频码流数值错误或为空 "),
    ERROR_2018("2018", "传入的默认视频分辩率值错误或为空或无权限 "),
    ERROR_2019("2019", "授权者用户名单为空或格式不正确，包括长度 "),
    ERROR_2020("2020", "会议室状态为空或者不在有效值(0、1) "),
    ERROR_3001("3001", "组织架构名称为空或格式不正确，包括长度 "),
    ERROR_3002("3002", "顶级组织只能存在一个 "),
    ERROR_3003("3003", "上级组织架构ID不能为当前组织的子级 "),
    ERROR_3004("3004", "上级组织架构ID不存在 "),
    ERROR_3005("3005", "上级组织架构ID不为空时格式不正确，包括长度，整数 "),
    ERROR_3006("3006", "组织架构ID不存在 "),
    ERROR_4001("4001", "应用返回提示不能为空或长度不能超过64 "),
    ERROR_4002("4002", "消息格式错误 "),
    ERROR_4003("4003", "服务器消息处理超时 "),
    ERROR_4004("4004", "请求消息未找到 "),
    ERROR_4005("4005", "服务器消息处理异常 "),
    ERROR_4006("4006", "会议室已过期 "),
    ERROR_4007("4007", "会议室已关闭 "),
    ERROR_4008("4008", "会议室所在节点服务器离线 "),
    ERROR_4009("4009", "用户属性值长度不能超过64*1000"),
    ERROR_4010("4010", "用户属性值不能为空 "),
    ERROR_4011("4011", "无法连接服务器 "),
    ERROR_4012("4012", "操作者长度不能超过64 ");
    String code;
    String remark;
}
